Ran Plan for project: `sharedservices-prod` dir: `accounts/sharedservices-prod` workspace: `default`

<details><summary>Show Output</summary>

```diff
Wrote /home/atlantis/.atlantis/prod-ue2-multiaccounts.tfvars with secrets from SSM.


Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create

Terraform will perform the following actions:

  # aws_cloudwatch_event_target.crossaccount_target will be created
+ resource "aws_cloudwatch_event_target" "crossaccount_target" {
      + arn            = (known after apply)
      + event_bus_name = "default"
      + force_destroy  = false
      + id             = (known after apply)
      + rule           = "crossaccount-invoker-schedule"
      + target_id      = "crossaccount-invoker-target"
    }

  # aws_lambda_function.crossaccounts_invoker will be created
+ resource "aws_lambda_function" "crossaccounts_invoker" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + code_sha256                    = (known after apply)
      + filename                       = "./artifacts/scripts/crossaccount_invoker/crossaccount_invoker.zip"
      + function_name                  = "crossaccount_invoker"
      + handler                        = "lambda_function.lambda_handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 128
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = "arn:aws:iam::825765422855:role/ExternalLambdaRole"
      + runtime                        = "python3.9"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = "u1zQjNMzh96zurDED1xVEeZ5Oxb5pkJNNvYJOJJeGb0="
      + source_code_size               = (known after apply)
      + tags_all                       = {
          + "DeployedBy"  = "Terraform"
          + "Environment" = "prod"
          + "Project"     = "sharedservices"
        }
      + timeout                        = 3
      + version                        = (known after apply)

      + environment {
          + variables = {
              + "CROSS_ACCT_ROLES" = jsonencode(
                    [
                      + "arn:aws:iam::481665084477:role/CrossAccountStartExecutionRole",
                      + "arn:aws:iam::390402544450:role/CrossAccountStartExecutionRole",
                    ]
                )
            }
        }

      + ephemeral_storage (known after apply)

      + logging_config (known after apply)

      + tracing_config (known after apply)
    }

  # aws_lambda_permission.allow_eventbridge_trigger will be created
+ resource "aws_lambda_permission" "allow_eventbridge_trigger" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "crossaccount_invoker"
      + id                  = (known after apply)
      + principal           = "events.amazonaws.com"
      + source_arn          = "arn:aws:events:us-east-2:825765422855:rule/crossaccount-invoker-schedule"
      + statement_id        = "AllowExecutionFromEventBridge"
      + statement_id_prefix = (known after apply)
    }

Plan: 3 to add, 0 to change, 0 to destroy.
╷
│ Warning: Value for undeclared variable
│ 
│ The root module does not declare a variable named "teams_webhooks" but a
│ value was found in file
│ "/home/atlantis/.atlantis/prod-ue2-multiaccounts.tfvars". If you meant to
│ use this value, add a "variable" block to the configuration.
│ 
│ To silence these warnings, use TF_VAR_... environment variables to provide
│ certain "global" settings to all configurations in your organization. To
│ reduce the verbosity of these warnings, use the -compact-warnings option.
╵
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -p sharedservices-prod
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](http://atlantis.feedutopia.com:4141/lock?id=ryan-longoria%252FFeedUtopia%252Faccounts%252Fsharedservices-prod%252Fdefault)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -p sharedservices-prod
  ```
Plan: 3 to add, 0 to change, 0 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this Pull Request, comment:
  ```shell
  atlantis apply
  ```
* :put_litter_in_its_place: To **delete** all plans and locks from this Pull Request, comment:
  ```shell
  atlantis unlock
  ```